name: "just_nir"
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param{
    scale: 0.83333
  }


  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_300_5_2_train/nir_train_db"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
#  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_150_5_2_val/nir_val_db"
#     source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_250_5_2_eval/nir_eval_db"
    batch_size: 1
    backend: LMDB
  }
}


layer {
  name: "nir_data/bn"
  type: "BatchNorm"
  bottom: "data"
  top: "nir_data/bn"
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "nir_data/bn"
  top: "conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 235
    kernel_size: 1
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

layer {
  name: "nir/fc1"
  type: "InnerProduct"
  bottom: "conv1"
  top: "nir/fc1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 616
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu/fc1"
  type: "ReLU"
  bottom: "nir/fc1"
  top: "nir/fc1"
}
layer {
  name: "nir/fc2"
  type: "InnerProduct"
  bottom: "nir/fc1"
  top: "nir/fc2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 400
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu/fc2"
  type: "ReLU"
  bottom: "nir/fc2"
  top: "nir/fc2"
}

layer {
  name: "nir/fc3"
  type: "InnerProduct"
  bottom: "nir/fc2"
  top: "nir/fc3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 616
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu/fc3"
  type: "ReLU"
  bottom: "nir/fc3"
  top: "nir/fc3"
}

layer {
    name: "reshape"
    type: "Reshape"
    bottom: "nir/fc3"
    top: "nir_fc3/reshaped"
    reshape_param { shape { dim: 0 dim: 1 dim: 11 dim: 56 } }
}
layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "nir_fc3/reshaped"
  top: "deconv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 235
    kernel_size: 1
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}


layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "deconv1"
  bottom: "data"
  top: "l2_error"
  loss_weight: 1
}
