name: "EarlyFusion02062018"

#Image data
layer {
  name: "data/img"
  type: "Data"
  top: "data/img"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/mean/img_5_2_mean.binaryproto"
  }
  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_300_5_2_train/img_train_db"
    batch_size: 1
    backend: LMDB
  }
}
layer {
  name: "data/img"
  type: "Data"
  top: "data/img"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
  }
  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_150_5_2_val/img_val_db"
#    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_250_5_2_eval/img_eval_db"
    batch_size: 1
    backend: LMDB
  }
}

# --------- encoding part ---------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data/img"
  top: "conv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 7
    stride: 2
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu1conv1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool:  MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "flatten_conv4"
  type: "Flatten"
  bottom: "pool4"
  top: "flatten_conv4"
}


layer {
  name: "img/fc1"
  type: "InnerProduct"
  bottom: "flatten_conv4"
  top: "img/fc1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 500
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc1"
  type: "ReLU"
  bottom: "img/fc1"
  top: "img/fc1"
}

layer {
  name: "img/fc2"
  type: "InnerProduct"
  bottom: "img/fc1"
  top: "img/fc2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 250
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc2"
  type: "ReLU"
  bottom: "img/fc2"
  top: "img/fc2"
}

layer {
  name: "img/fc3"
  type: "InnerProduct"
  bottom: "img/fc2"
  top: "img/fc3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 50
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc3"
  type: "ReLU"
  bottom: "img/fc3"
  top: "img/fc3"
}
layer {
  name: "img/fc4"
  type: "InnerProduct"
  bottom: "img/fc3"
  top: "img/fc4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 10
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc4"
  type: "ReLU"
  bottom: "img/fc4"
  top: "img/fc4"
}

layer {
  name: "img/fc5"
  type: "InnerProduct"
  bottom: "img/fc4"
  top: "img/fc5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 5
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc5"
  type: "ReLU"
  bottom: "img/fc5"
  top: "img/fc5"
}

layer {
  name: "img/fc6"
  type: "InnerProduct"
  bottom: "img/fc5"
  top: "img/fc6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 10
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc6"
  type: "ReLU"
  bottom: "img/fc6"
  top: "img/fc6"
}

layer {
  name: "img/fc7"
  type: "InnerProduct"
  bottom: "img/fc6"
  top: "img/fc7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 50
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc7"
  type: "ReLU"
  bottom: "img/fc7"
  top: "img/fc7"
}

layer {
  name: "img/fc8"
  type: "InnerProduct"
  bottom: "img/fc7"
  top: "img/fc8"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 250
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc8"
  type: "ReLU"
  bottom: "img/fc8"
  top: "img/fc8"
}
layer {
  name: "img/fc9"
  type: "InnerProduct"
  bottom: "img/fc8"
  top: "img/fc9"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 500
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc9"
  type: "ReLU"
  bottom: "img/fc9"
  top: "img/fc9"
}

layer {
  name: "img/fc10"
  type: "InnerProduct"
  bottom: "img/fc9"
  top: "img/fc10"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 2048
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc10"
  type: "ReLU"
  bottom: "img/fc10"
  top: "img/fc10"
}

layer {
  name: "reshape/fc10"
  type: "Reshape"
  bottom: "img/fc10"
  top: "fc10_reshaped"
  reshape_param {
    shape {
      dim: 0  # copy the dimension from below
      dim: 512
      dim: 2
      dim: 2 # infer it from the other dimensions
     }
   }
}

layer {
  name: "deconv5"
  type: "Deconvolution"
  bottom: "fc10_reshaped"
  top: "deconv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 512
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reludeconv5"
  type: "ReLU"
  bottom: "deconv5"
  top: "deconv5"
}

layer {
  name: "deconv4"
  type: "Deconvolution"
  bottom: "deconv5"
  top: "deconv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reludeconv4"
  type: "ReLU"
  bottom: "deconv4"
  top: "deconv4"
}
layer {
  name: "unpool4"
  type: "UNPOOLING"
  bottom: "deconv4"
  top: "unpool4"
  unpooling_param {
     unpool: MAX
     kernel_size: 3
     stride: 2
     unpool_size: 18
  }
}


###############




layer {
  name: "deconv3"
  type: "Deconvolution"
  bottom: "unpool4"
  top: "deconv3" 
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 128
    kernel_size: 5
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reludeconv3"
  type: "ReLU"
  bottom: "deconv3"
  top: "deconv3"
}

layer {
  name: "unpool3"
  type: "UNPOOLING"
  bottom: "deconv3"
#  bottom: "pool2_mask"
  top: "unpool3"
  unpooling_param {
     unpool: MAX
     kernel_size: 2
     stride: 2
     unpool_size: 44
  }
}
layer {
  name: "deconv2"
  type: "Deconvolution"
  bottom: "unpool3"
  top: "deconv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 64
    kernel_size: 5
    stride: 1
#    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv2relu"
  type: "ReLU"
  bottom: "deconv2"
  top: "deconv2"
}

layer {
  name: "unpool2"
  type: "UNPOOLING"
  bottom: "deconv2"
#  bottom: "pool1_mask"
  top: "unpool2"
  unpooling_param {
    unpool: MAX
    kernel_size: 2
    stride: 2
    unpool_size: 96
  }
}

layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "unpool2"
  top: "deconv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 3
    kernel_size: 7
    stride: 2
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv1relu"
  type: "ReLU"
  bottom: "deconv1"
  top: "deconv1"
}

layer {
  name: "deconv0"
  type: "Deconvolution"
  bottom: "deconv1"
  top: "deconv0"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 3
    kernel_size: 31
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}


layer {
  name: "deconv0relu"
  type: "ReLU"
  bottom: "deconv0"
  top: "deconv0"
}



# --------- calculate loss ---------
#layer {
#  name: "loss"
#  type: "SigmoidCrossEntropyLoss"
#  bottom: "deconv0"
#  bottom: "data"
#  top: "cross_entropy_loss"
#  loss_weight: 1
#}
#layer {
#  name: "deconv1neursig"
#  type: "Sigmoid"
#  bottom: "deconv0"
#  top: "deconv1neursig"
#}
#layer {
#  name: "loss/img"
#  type: "EuclideanLoss"
#  bottom: "deconv0"
#  bottom: "img_data/scale"
 # top: "l2_error/img"
 # loss_weight: 1
#}
