name: "autoencoder_based_on_alexnet_08_07_2018"
#Image data
layer {
  name: "data/img"
  type: "Data"
  top: "data/img"
  include {
    phase: TRAIN
  }
  transform_param {
#    mean_file: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/mean/img_5_2_mean.binaryproto"
    scale: 0.003921569
  }
  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_300_5_2_train/img_train_db"
    batch_size: 30
    backend: LMDB
  }
}
layer {
  name: "data/img"
  type: "Data"
  top: "data/img"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.003921569
  }
  data_param {
#    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_150_5_2_val/img_val_db"
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_250_5_2_eval/img_eval_db"
    batch_size: 1
    backend: LMDB
  }
}


################# NIR ####################################################################################################
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.83333
  }
  data_param {
    source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_300_5_2_train/nir_train_db"
    batch_size: 30
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.83333
  }
  data_param {
#     source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_150_5_2_val/nir_val_db"
     source: "/home/lod/master-thesis/LMDB-datasets/prepared_dataSets/dataSet_5c_250_5_2_eval/nir_eval_db"
    batch_size: 1
    backend: LMDB
  }
}

layer {
  name: "nir_data/bn"
  type: "BatchNorm"
  bottom: "data"
  top: "nir_data/bn"
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}

layer {
  name: "conv1_nir"
  type: "Convolution"
  bottom: "nir_data/bn"
  top: "conv1_nir"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 235
    kernel_size: 3
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv1"
  type: "PReLU"
  bottom: "conv1_nir"
  top: "conv1_nir"
}

layer {
  name: "conv2_nir"
  type: "Convolution"
  bottom: "conv1_nir"
  top: "conv2_nir"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 100
    kernel_size: 3
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv2"
  type: "PReLU"
  bottom: "conv2_nir"
  top: "conv2_nir"
}

layer {
  name: "conv3_nir"
  type: "Convolution"
  bottom: "conv2_nir"
  top: "conv3_nir"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 50
    kernel_size: 3
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv3"
  type: "PReLU"
  bottom: "conv3_nir"
  top: "conv3_nir"
}

layer {
  name: "conv4_nir"
  type: "Convolution"
  bottom: "conv3_nir"
  top: "conv4_nir"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 25
    kernel_size: 3
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv4"
  type: "PReLU"
  bottom: "conv4_nir"
  top: "conv4_nir"
}

layer {
  name: "conv5_nir"
  type: "Convolution"
  bottom: "conv4_nir"
  top: "conv5_nir"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 5
    kernel_size: 3
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "nir_relu/conv5"
  type: "PReLU"
  bottom: "conv5_nir"
  top: "conv5_nir"
}
layer {
  name: "nir/flatten"
  type: "Flatten"
  bottom: "conv5_nir"
  top: "nir/flatten"
}

layer {
  name: "nir/fc1"
  type: "InnerProduct"
  bottom: "nir/flatten"
  top: "nir/fc1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 100
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu_nir/fc1"
  type: "PReLU"
  bottom: "nir/fc1"
  top: "nir/fc1"
}
layer {
  name: "nir/fc2"
  type: "InnerProduct"
  bottom: "nir/fc1"
  top: "nir/fc2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 50
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu/fc2"
  type: "PReLU"
  bottom: "nir/fc2"
  top: "nir/fc2"
}




############# IMG #####################################################################################

layer {
  name: "img_data/bn"
  type: "BatchNorm"
  bottom: "data/img"
  top: "img_data/bn"
  batch_norm_param {
    moving_average_fraction: 0.9
  }
}



# --------- encoding part ---------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "img_data/bn"
  top: "conv1"
  param { lr_mult: 0.0001 decay_mult: 1 }
  param { lr_mult: 0.0002 decay_mult: 0 }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "relu1conv1"
  type: "PReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool:  MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param { lr_mult: 0.001 decay_mult: 1 }
  param { lr_mult: 0.002 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 5
    pad: 2
    group: 2
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv2"
  type: "PReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param { lr_mult: 0.01 decay_mult: 1 }
  param { lr_mult: 0.02 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv3"
  type: "PReLU"
  bottom: "conv3"
  top: "conv3"
}

################
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.2 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    group: 2
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv4"
  type: "PReLU"
  bottom: "conv4"
  top: "conv4"
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    group: 2
    stride: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "reluconv5"
  type: "PReLU"
  bottom: "conv5"
  top: "conv5"
}

layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "img/flatten"
  type: "Flatten"
  bottom: "pool3"
  top: "img/flatten"
}

layer {
  name: "img/fc1"
  type: "InnerProduct"
  bottom: "img/flatten"
  top: "img/fc1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc1"
  type: "PReLU"
  bottom: "img/fc1"
  top: "img/fc1"
}

layer {
  name: "img/fc2"
  type: "InnerProduct"
  bottom: "img/fc1"
  top: "img/fc2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc2"
  type: "PReLU"
  bottom: "img/fc2"
  top: "img/fc2"
}

layer {
  name: "img/fc3_r"
  type: "InnerProduct"
  bottom: "img/fc2"
  top: "img/fc3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 550
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu_r/fc3"
  type: "PReLU"
  bottom: "img/fc3"
  top: "img/fc3"
}
####################################################################################################################################
layer {
  name: "img_nir/concat"
  type: "Concat"
  bottom: "img/fc3"
  bottom: "nir/fc2"
  top: "img_nir/concat"
  concat_param {
    axis: 1
}
}
####################################################################################################################################
layer {
  name: "img/fc4r"
  type: "InnerProduct"
  bottom: "img_nir/concat"
  top: "img/fc4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc4r"
  type: "PReLU"
  bottom: "img/fc4"
  top: "img/fc4"
}

layer {
  name: "img/fc5"
  type: "InnerProduct"
  bottom: "img/fc4"
  top: "img/fc5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc5"
  type: "PReLU"
  bottom: "img/fc5"
  top: "img/fc5"
}

layer {
  name: "img/fc6"
  type: "InnerProduct"
  bottom: "img/fc5"
  top: "img/fc6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param {
    num_output: 9216
    weight_filler { type: "msra"}
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "img_relu/fc6"
  type: "PReLU"
  bottom: "img/fc6"
  top: "img/fc6"
}

layer {
  name: "img/reshape"
  type: "Reshape"
  bottom: "img/fc6"
  top: "img/reshape"
  reshape_param {
    shape {
      dim: 0  # copy the dimension from below
      dim: 256
      dim: 6
      dim: 6 # infer it from the other dimensions
     }
   }
}


layer {
  name: "unpool1"
  type: "UNPOOLING"
  bottom: "img/reshape"
  top: "unpool1"
  unpooling_param {
    unpool: MAX
    kernel_size: 3
    stride: 2
    unpool_size: 13
  }
}

layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "unpool1"
  top: "deconv1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv1relu"
  type: "PReLU"
  bottom: "deconv1"
  top: "deconv1"
}

layer {
  name: "deconv2"
  type: "Deconvolution"
  bottom: "deconv1"
  top: "deconv2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv2relu"
  type: "PReLU"
  bottom: "deconv2"
  top: "deconv2"
}

layer {
  name: "deconv3"
  type: "Deconvolution"
  bottom: "deconv2"
  top: "deconv3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv3relu"
  type: "PReLU"
  bottom: "deconv3"
  top: "deconv3"
}

layer {
  name: "unpool2"
  type: "UNPOOLING"
  bottom: "deconv3"
  top: "unpool2"
  unpooling_param {
    unpool: MAX
    kernel_size: 3
    stride: 2
    unpool_size: 27
  }
}

layer {
  name: "deconv4"
  type: "Deconvolution"
  bottom: "unpool2"
  top: "deconv4"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv4relu"
  type: "PReLU"
  bottom: "deconv4"
  top: "deconv4"
}

layer {
  name: "unpool3"
  type: "UNPOOLING"
  bottom: "deconv4"
  top: "unpool3"
  unpooling_param {
    unpool: MAX
    kernel_size: 3
    stride: 2
    unpool_size: 55
  }
}

layer {
  name: "deconv5"
  type: "Deconvolution"
  bottom: "unpool3"
  top: "deconv5"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "deconv5relu"
  type: "PReLU"
  bottom: "deconv5"
  top: "deconv5"
}

layer {
  name: "output"
  type: "Deconvolution"
  bottom: "deconv5"
  top: "output"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param {
    num_output: 3
    kernel_size: 11
    stride: 4
    weight_filler { type: "msra" }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "outputrelu"
  type: "PReLU"
  bottom: "output"
  top: "output"
}

layer {
  name: "loss_img"
  type: "EuclideanLoss"
  bottom: "output"
  bottom: "data/img"
  top: "error/img"
  loss_weight: 1
}
